#include "document_instruc.h"

void instuct()
{
	printf("Чтобы написать факториал надо его вводить до числа, а не после.\nНапример как в математике: 5!, и как тут: !5\n");
	printf("Чтобы выйти из програмы можно закрыть с помощью крестика, либо нажать кнопку ESC\n");
	printf("Нельзя использовать более двух легких выражений например a + b можно, но a + b + c... нельзя.\nТакже нельзя использовать скобки.\nЕсли вы хотите ввести факториал и еще выражение то будет ошибка.\nЧтобы написать степень переключитесь на английскую раскладку зажмите SHIFT и нажмите 6, после пишите степень\n");
	printf("Буква:t это тангенс\nБуква:i это in\nБуква:d это log10\nБуква:s это sin\nБуква:c это cos\nБуква:a это arcsin\nБуква:r это arccos\nБуква:g это arctg(x)\nБуква:G это arctg(x, y)\n\n\n\n");
}